import { useEffect } from "react";
import { useDocumentTitle } from "@mantine/hooks";
import { List, Text, Paper, Title } from "@mantine/core";

export function PrivacypolicyPage() {
  useDocumentTitle("นโยบายความเป็นส่วนตัว | ศูนย์ร่มโพธิ์ร่มไทรวัยดอกลำดวน");
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  return (
    <>
      <Paper shadow="xs" p="xl">
        <Title size="h1">นโยบายความเป็นส่วนตัว (PRIVACY POLICY)</Title>
        <Text size={"xl"} mt={10}>
          การเปิดเผยข้อมูลส่วนบุคคล
        </Text>
        <List>
          <List.Item>
            เราจะไม่ขายหรือเผยแพร่ข้อมูลส่วนตัวของคุณให้แก่บุคคลที่สามอื่น
            หรือองค์กรอื่นใด
            การเปิดเผยข้อมูลจะเกิดขึ้นก็ต่อเมื่อคุณเป็นผู้ร้องขอและให้ความยินยอมให้เราดำเนินการให้
            หรือ การเปิดเผยข้อมูลนั้นเป็นไปตามที่กฎหมายอนุญาต
            หรือเป็นไปตามที่กฎหมายกำหนด อาทิ
            การเปิดเผยข้อมูลตามคำสั่งเจ้าหน้าที่ของรัฐซึ่งกฎหมายได้ให้อำนาจไว้
            ตามคำสั่งศาล หรือตามหมายศาล
          </List.Item>
          <List.Item>
            เพื่อการพัฒนาและบำรุงรักษาระบบการของเราให้มีความปลอดภัยและมีประสิทธิภาพสูงสุด
            เราอาจทำความตกลงไว้กับบุคคลที่สามเพื่อให้ดำเนินงานกับเรา
            หรือดำเนินการในนามของเรา
            ทั้งนี้บุคคลที่สามนั้นจะต้องยอมรับข้อตกลงคุ้มครองข้อมูลส่วนตัวของคุณไว้เป็นความลับเช่นเดียวกัน
          </List.Item>
          <List.Item>
            ในบางกรณี
            เราอาจดำเนินการนโยบายการตลาดหรือโฆษณาส่งเสริมบริการร่วมกับบุคคลที่สามสำหรับกลุ่มผู้ที่ยังไม่เคยใช้บริการ
            เราจึงสงวนสิทธิในการยืนยันรับรองกับบุคคลที่สามว่าคุณได้ใช้บริการกับเราแล้ว
          </List.Item>
        </List>

        <Text size={"xl"} mt={10}>
          การเก็บรักษาข้อมูล
        </Text>
        <List>
          <List.Item>
            ข้อมูลที่เราจำเป็นต้องร้องขอเพื่อใช้สำหรับยืนยันตัวตนจากคุณได้แก่
            ชื่อนามสกุล และ อีเมล นอกจากนี้อาจมีการเก็บข้อมูล ไอพีแอดเดรส
            เพื่อให้เป็นไปตามข้อกำหนดทางกฎหมาย
          </List.Item>
          <List.Item>
            เราจะไม่ใช้ข้อมูลส่วนตัวของคุณเพื่อวัตถุประสงค์ใดนอกจากให้บริการหรือเท่าที่กฎหมายกำหนด
            เราเคารพและคำนึงถึงความเป็นส่วนตัวของลูกค้าของเราอย่างสูงสุด
            สิ่งที่สำคัญที่สุดคือความสัมพันธ์ระหว่างคุณและเรา
            เราต้องการให้คุณสบายใจและมั่นใจใช้ผลิตภัณฑ์และบริการของเราและเชื่อถือความปลอดภัยของข้อมูลส่วนตัวและแบบแสดงรายการที่คุณกรอกไว้ให้เรา
          </List.Item>
          <List.Item>
            คุณมีหน้าที่ปกป้องข้อมูลบนอุปกรณ์ของคุณเช่นการใช้โปรแกรมป้องกันไวรัส,
            การอัพเดตซอฟท์แวร์, เปลี่ยนรหัสผ่าน,
            และไม่ให้บุคคลที่สามเข้าถึงอุปกรณ์ของคุณได้ไม่ว่าทางใด
          </List.Item>
        </List>

        <Text size={"xl"} mt={10}>
          การลบข้อมูล
        </Text>
        <List>
          <List.Item>
            ศูนย์ร่มโพธิ์ร่มไทรวัยดอกลำดวน
            มีเจตนารักษาข้อมูลบุคคลของคุณให้ถูกต้องและอัพเดทอยู่เสมอ
            โดยเราจะลบข้อมูลของคุณทั้งหมดหากไม่จำเป็นต้องใช้ข้อมูลเหล่านั้นแล้ว
          </List.Item>
          <List.Item>
            คุณมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของคุณได้ตลอดเวลา
            หากคุณต้องการใช้สิทธิ์นี้กรุณาติดต่อ ผ่านทางเบอร์ติดต่อสอบถาม
            และแจ้งคำร้องขอให้ทำลายข้อมูลของคุณ
            โดยเจ้าหน้าที่อาจมีการขอให้แสดงตัวเพื่อยืนยันความเป็นเจ้าของข้อมูล
          </List.Item>
        </List>

        <Text size={"xl"} mt={10}>
          ความปลอดภัยของข้อมูล
        </Text>
        <List>
          <List.Item>
            เพราะข้อมูลของคุณเป็นสิ่งที่มีค่ามากที่สุด
            เราให้ความสำคัญกับความเชื่อมั่นของคุณเป็นอันดับหนึ่งสำหรับเรา
            เราระลึกอยู่เสมอว่าคุณต้องการความปลอดภัยสูงสุดในการใช้บริการและรักษาความลับของข้อมูลส่วนตัว
            เราจึงดำเนินการอย่างเข้มงวดเพื่อรักษาความปลอดภัยและป้องกันการนำข้อมูลของคุณโดยไม่ได้รับอนุญาตด้วยมาตรฐานขั้นสูง
          </List.Item>
          <List.Item>
            เราใช้ระบบรักษาความปลอดภัยของข้อมูลที่มีมาตรฐานระดับเดียวกับธนาคารและสายการบินที่เป็นที่ยอมรับในระดับสากลทั้งในส่วนของเทคโนโลยีและกระบวนการเพื่อป้องกันการโจรกรรมข้อมูลที่เป็นความลับโดยคำนึงถึงประสิทธิภาพสูงสุด
            เราได้จัดสรรเวลา บุคลากร และทรัพยากรต่างๆ
            อย่างเต็มที่เพื่อให้คุณมั่นใจในการรักษาความปลอดภัยที่ได้มาตรฐานสูงสุดของเรา
            ซึ่งรวมถึงเทคโนโลยีเข้ารหัสข้อมูลในระดับ 256 บิท (256-bit
            Encryption)
            ซึ่งเป็นการเข้ารหัสระดับสูงสุดของให้บริการมาตรฐานเดียวกับการทำธุรกรรมทางอินเทอร์เน็ตของธนาคารและสายการบิน
          </List.Item>
          <List.Item>
            เราทำการทดสอบและปรับปรุงเทคโนโลยีรักษาความปลอดภัยของเราอย่างต่อเนื่องและสม่ำเสมอเพื่อให้คุณมั่นใจว่าข้อมูลส่วนตัวของคุณได้รับการดูแลด้วยมาตรการรักษาความปลอดภัยสูงสุด
          </List.Item>
        </List>
      </Paper>
    </>
  );
}
